Словарь/src/Catalogs/Канджи/Канджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Канджи</name>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Чтения</name>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>CatalogRef.ЧтенияКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧтения</name>
      <type>
        <types>EnumRef.ВидыЧтенийКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУдвоениеКанджи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Канджи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить обновить чтение.
// 
// Параметры:
//  Канджи - СправочникСсылка.Канджи - ссылка на канджи
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица слов:
//  * Слово - СправочникСсылка.Словарь - слово
Функция СловаПоКанджи(Канджи) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СловарьСостав.Ссылка КАК Слово
	|ИЗ
	|	Справочник.Словарь.Состав КАК СловарьСостав
	|ГДЕ
	|	СловарьСостав.Канджи = &Канджи
	|
	|УПОРЯДОЧИТЬ ПО
	|	СловарьСостав.Ссылка.Наименование";
	Запрос.УстановитьПараметр("Канджи", Канджи);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Текст запроса поиск дублей
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаПоискДублей() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	Канджи.ЮникодПредставление КАК Канджи,
	|	Канджи.Наименование КАК Наименование,
	|	Канджи.ОсновноеЗначение КАК ОсновноеЗначение,
	|	Канджи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Канджи КАК Канджи
	|ГДЕ
	|	Канджи.Юникод = &Юникод
	|	И Канджи.Ссылка <> &Ссылка
	|	И НЕ Канджи.ПометкаУдаления";
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("ЮникодПредставление");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Данные.Наименование) Тогда
		Представление = "Канджи (новый)";	
	Иначе
		Представление = СтрШаблон("%1 - %2", Данные.Наименование, Данные.ЮникодПредставление);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
